//二维数组的遍历


public class TwoDimensionalArray04 {
	public static void main(String[] args) {
		
		//int[][] arr = {{4,6},{1,4,5,7},{-2}};\
		//遍历该二维数组，并得到和
		
		int[][] arr = {{4,6},{1,4,5,7},{-2}};
		int sum = 0;//用于累积和
		for (int i = 0; i < arr.length; i++) {//遍历arr每一个一维数组
			
			//遍历一维数组，并给一维数组的每个元素数值
			for (int j = 0; j < arr[i].length; j++) {
				sum += arr[i][j];				
			}		
		}
	System.out.print("二维数组中所有元素的和=" + sum);
	}
}



//使用方法4：静态初始化
//
//int[][] arr = {{1,1,1},{8,8,9},{100}}
//
//定义了一个二维数组arr
//arr有三个元素（每个元素是一维数组）
//第一个一维数组有三个元素...第三个一维数组只有1个元素
//
//
//注意事项
//int[] y[] 也表示二维数组
//
//
//课堂练习
//
//声明 int[] x,y[],一下允许通过编译的是:()
// 	a) x[0] = y;			//错误
//	b) y[0] = x;			//正确
//	c) y[0][0] = x;			//错误
//	d) x[0][0] = y;			//错误
//	e) y[0][0] = x[0];		//正确
//	f) x = y;				//错误
//
//分析
//x为一维数组 y为二维数组
//
//答案
//b e